Revit 2025 API
Rebar.RebarShapeMatchesCurvesAndHooks Method
 Checks if rebarShape matches curves and hooks. If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, then this method will ignore the hook information.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static bool RebarShapeMatchesCurvesAndHooks(
	RebarShape rebarShape,
	RebarBarType barType,
	XYZ norm,
	IList<Curve> curves,
	RebarHookType startHook,
	RebarHookType endHook,
	RebarHookOrientation startHookOrient,
	RebarHookOrientation endHookOrient
)
Public Shared Function RebarShapeMatchesCurvesAndHooks (
	rebarShape As RebarShape,
	barType As RebarBarType,
	norm As XYZ,
	curves As IList(Of Curve),
	startHook As RebarHookType,
	endHook As RebarHookType,
	startHookOrient As RebarHookOrientation,
	endHookOrient As RebarHookOrientation
) As Boolean
public:
static bool RebarShapeMatchesCurvesAndHooks(
	RebarShape^ rebarShape,
	RebarBarType^ barType,
	XYZ^ norm,
	IList<Curve^>^ curves,
	RebarHookType^ startHook,
	RebarHookType^ endHook,
	RebarHookOrientation startHookOrient,
	RebarHookOrientation endHookOrient
)
static member RebarShapeMatchesCurvesAndHooks :
        rebarShape : RebarShape *
        barType : RebarBarType *
        norm : XYZ *
        curves : IList<Curve> *
        startHook : RebarHookType *
        endHook : RebarHookType *
        startHookOrient : RebarHookOrientation *
        endHookOrient : RebarHookOrientation -> bool
Parameters
rebarShape RebarShape
 A RebarShape element that defines the shape of the rebar.
barType RebarBarType
 A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
norm XYZ
 The normal to the plane that the rebar curves lie on.
curves IList<Curve>
 An array of curves that define the shape of the rebar curves. They must belong to the plane defined by the normal and origin. Bends and hooks should not be included in the array of curves.
startHook RebarHookType
 A RebarHookType element that defines the hook for the start of the bar.
endHook RebarHookType
 A RebarHookType element that defines the hook for the end of the bar.
startHookOrient RebarHookOrientation
 Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal. Only two values are permitted: Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
endHookOrient RebarHookOrientation
 Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal. Only two values are permitted: Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
Return Value
Boolean
 True if rebarShape matches curves and hooks.
Exceptions
Exception | Condition
ArgumentException |  The input curves is empty. -or- The input curves contains at least one curve which is not a bound Line or bound Arc and is not supported for this operation. -or- curves do not form a valid CurveLoop. -or- The input curves contains at least one helical curve and is not supported for this operation.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  norm has zero length. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace